Repository: ethancodes-6969/ASHA-EHR
Catalog: lib/l10n/app_*.arb
Languages: hi, mr

# appTitle
source: ASHA EHR
hi: आशा ईएचआर
mr: आशा ईएचआर

source: Save
hi: सहेजें
mr: जतन करा

source: Cancel
hi: रद्द करें
mr: रद्द करा

source: Sync Now
hi: अभी सिंक करें
mr: आता सिंक करा

source: Last synced
hi: अंतिम सिंक
mr: शेवटचे सिंक

source: Not synced yet
hi: अभी तक सिंक नहीं हुआ
mr: अद्याप सिंक केलेले नाही

# syncFailed
source: Last sync failed â€” data is safe
hi: पिछला सिंक विफल - डेटा सुरक्षित है
mr: शेवटचे सिंक अयशस्वी — डेटा सुरक्षित आहे

source: Households
hi: परिवार
mr: कुटुंबे

source: Members
hi: सदस्य
mr: सदस्य

source: Visits
hi: भेंट
mr: भेटी

# dueVisits
source: Visits Due
hi: बकाया भेट
mr: बाकी भेटी

source: Settings
hi: सेटिंग्स
mr: सेटिंग्ज

source: Language
hi: भाषा
mr: भाषा

source: Select Language
hi: भाषा चुनें
mr: भाषा निवडा

source: Retry
hi: पुनः प्रयास करें
mr: पुन्हा प्रयत्न करा

# syncing
source: Syncing Data...
hi: डेटा सिंक हो रहा है...
mr: डेटा सिंक होत आहे...

source: Sync Complete
hi: सिंक पूर्ण
mr: सिंक पूर्ण झाले

source: Confirm Restore
hi: रिस्टोर की पुष्टि करें
mr: रिस्टोरची पुष्टी करा

# restoreConfirmMessage
source: Are you sure you want to restore data for ID: {id}? CURRENT DATA WILL BE MERGED.
hi: क्या आप ID: {id} के लिए डेटा रिस्टोर करना सुनिश्चित हैं? मौजूदा डेटा मर्ज किया जाएगा।
mr: तुम्ही नक्की ID: {id} साठी डेटा रिस्टोर करू इच्छिता? सध्याचा डेटा विलीन केला जाईल.

source: Restoring...
hi: रिस्टोर हो रहा है...
mr: रिस्टोर होत आहे...

source: Recovery
hi: रिकवरी
mr: रिकवरी

source: Search
hi: खोजें
mr: शोधा

source: Search Households
hi: घर खोजें
mr: कुटुंब शोधा

# searchHouseholdsHint
source: Name or Location
hi: नाम या स्थान
mr: नाव किंवा ठिकाण

# noResults
source: No results found.
hi: कोई परिणाम नहीं मिला।
mr: काहीही सापडले नाही.

source: Archive
hi: आर्काइव करें
mr: संग्रहित करा

source: Edit
hi: संपादित करें
mr: संपादित करा

source: Archive Household?
hi: घर आर्काइव करें?
mr: कुटुंब संग्रहित करायचे?

# archiveHouseholdConfirm
source: This will hide the household and its members. It can be restored by admin only.
hi: यह घर और उसके सदस्यों को छिपा देगा। इसे केवल एडमिन ही पुनर्स्थापित कर सकता है।
mr: हे घर आणि त्याचे सदस्य लपवले जातील. हे केवळ ऍडमिनद्वारेच पुनर्संचयित केले जाऊ शकते.

source: Edit Household
hi: घर संपादित करें
mr: कुटुंब संपादित करा

source: Create Household
hi: नया घर बनाएं
mr: नवीन कुटुंब जोडा

source: Household Details
hi: घर का विवरण
mr: कुटुंबाचे विवरण

source: Family Head Name *
hi: मुखिया का नाम *
mr: कुटुंब प्रमुखाचे नाव *

# villageName
source: Village / Location Name *
hi: गाँव / स्थान का नाम *
mr: गाव / ठिकाणाचे नाव *

source: SAVE HOUSEHOLD
hi: घर सहेजें
mr: कुटुंब जतन करा

source: Members: {count}
hi: सदस्य: {count}
mr: सदस्य: {count}

source: Due Tasks
hi: बकाया कार्य
mr: बाकी कार्ये

source: Search Members
hi: सदस्य खोजें
mr: सदस्य शोधा

source: No members found.
hi: कोई सदस्य नहीं मिला।
mr: कोणीही सदस्य आढळले नाहीत.

source: Edit Member
hi: सदस्य संपादित करें
mr: सदस्य संपादित करा

source: Create Member
hi: नया सदस्य जोड़ें
mr: नवीन सदस्य जोडा

source: Personal Details
hi: व्यक्तिगत विवरण
mr: वैयक्तिक माहिती

source: Full Name *
hi: पूरा नाम *
mr: पूर्ण नाव *

source: Gender
hi: लिंग
mr: लिंग

source: Male
hi: पुरुष
mr: पुरुष

source: Female
hi: महिला
mr: स्त्री

source: Date of Birth
hi: जन्म तिथि
mr: जन्मतारीख

source: Is Pregnant?
hi: क्या गर्भवती है?
mr: गरोदर आहे का?

source: LMP Date
hi: एलएमपी तिथि
mr: एलएमपी तारीख

source: Delivery Date
hi: प्रसव तिथि
mr: प्रसूती तारीख

# healthId
source: ABHA / Health ID
hi: ABHA / हेल्थ आईडी
mr: ABHA / हेल्थ आयडी

source: SAVE MEMBER
hi: सदस्य सहेजें
mr: सदस्य जतन करा

source: Record Visit
hi: भेंट दर्ज करें
mr: भेट नोंदवा

source: Visit Details
hi: भेंट का विवरण
mr: भेटीचे तपशील

source: Visit Date
hi: भेंट की तिथि
mr: भेटीची तारीख

source: Visit Type
hi: भेंट का प्रकार
mr: भेटीचा प्रकार

# notes
source: Notes / Observations
hi: नोट्स / अवलोकन
mr: टीप / निरीक्षणे

# programTags
source: Program Tags (comma separated)
hi: प्रोग्राम टैग (अल्पविराम से अलग करें)
mr: प्रोग्राम टॅग (स्वल्पविरामाने वेगळे करा)

source: SAVE VISIT
hi: भेंट सहेजें
mr: भेट जतन करा

# dangerZone
source: Danger Zone: Restore Data
hi: डेंजर ज़ोन: डेटा पुनर्स्थापित करें
mr: डेंजर झोन: डेटा पुनर्संचयित करा

# restoreDataInstruction
source: If you reformatted your device, paste your OLD Device ID here to recover your data. WARNING: This will overwrite local data.
hi: यदि आपने अपना डिवाइस रीसेट किया है, तो अपना डेटा वापस पाने के लिए यहां अपना पुराना डिवाइस आईडी पेस्ट करें। चेतावनी: यह स्थानीय डेटा को मिटा देगा।
mr: जर तुम्ही तुमचे डिव्हाइस रिसेट केले असेल, तर तुमचा डेटा परत मिळवण्यासाठी येथे तुमचा जुना डिव्हाइस आयडी टाका. चेतावणी: यामुळे स्थानिक डेटा मिटविला जाईल.

source: Enter Old Device ID
hi: पुराना डिवाइस आईडी दर्ज करें
mr: जुना डिव्हाइस आयडी टाका

source: RESTORE DATA
hi: डेटा पुनर्स्थापित करें
mr: डेटा पुनर्संचयित करा

source: ID Copied
hi: आईडी कॉपी की गई
mr: आयडी कॉपी केला

source: Device Identity
hi: डिवाइस पहचान
mr: डिव्हाइस ओळख

source: ASHA Device ID
hi: आशा डिवाइस आईडी
mr: आशा डिव्हाइस आयडी

# errorSaving
source: Error saving: {error}
hi: सहेजने में त्रुटि: {error}
mr: जतन करताना त्रुटी: {error}

source: Required
hi: अनिवार्य है
mr: आवश्यक

# allCaughtUp
source: All caught up! No due tasks.
hi: सब हो गया! कोई कार्य शेष नहीं।
mr: सर्व काही झाले! कोणतीही कार्ये बाकी नाहीत.

# todayOverview
source: Today's Overview
hi: आज का अवलोकन
mr: आजचा आढावा

source: Navigation
hi: नेविगेशन
mr: नेव्हिगेशन

source: Households Register
hi: परिवार रजिस्टर
mr: कुटुंब रजिस्टर
